app/views/shared/_form.html.erb

  <%= post_fields.label :tags %>
  <%= post_fields.collection_check_boxes(
        :tag_ids,
        Tag.all.limit(5),
        :id,
        :name
        ) %>
---
SELECT  "tags".* FROM "tags" LIMIT $1  [["LIMIT", 5]]

  <h3>OR - Use this:</h3>
  <%= post_fields.collection_select(
      :tag_ids,
      Tag.all,
      :id,
      :name,
      {include_blank: true},
      { multiple: true}
  ) %>
---
SELECT "tags".id FROM "tags" INNER JOIN "posttags" ON "tags"."id" = "posttags"."tag_id" WHERE "posttags"."post_id" = $1  [["post_id", 151]]