app/views/posts/show.html.erb

SELECT "tags".* FROM "tags" INNER JOIN "posttags" ON "tags"."id" = "posttags"."tag_id" WHERE "posttags"."post_id" = $1  [["post_id", 151]]
---
<ul>
  <% @post.tags.each do |tag| %>