app/controllers/posts_controller.rb

  def update
    @post = Post.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 151], ["LIMIT", 1]]

  def create
    @post = Post.new(whitelisted_post_params)
    if @post.save
---
INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "This is a title"], ["body", "blkdsjfalkdjfalksdcmaskldfjasl;dfkj"], ["created_at", 2016-12-02 18:33:58 UTC], ["updated_at", 2016-12-02 18:33:58 UTC]]